app/views/posts/index.html.erb

        <div class="comment-info">
            <% post.recent_comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2)  [["post_id", 408], ["post_id", 407]]