app/views/posts/show.html.erb

    <div class="comment-info">
        <% @post.recent_comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]