app/controllers/likes_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "likes" ("author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author_id", 1], ["post_id", 1], ["created_at", "2022-07-30 16:16:18.992783"], ["updated_at", "2022-07-30 16:16:18.992783"]]
---
  def create
    @post = Post.find(params[:post_id] || params[:id])
    @like = Like.new(post_id: @post.id, author_id: current_user.id)
    @like.author_id = current_user.id

    respond_to do |format|
      if @like.save